actuator/NS-DBD/fvOptions_triangle/system/setExprFieldsDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
    Umod
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        constants
        {
            bladeSpeed (0 2.0 0);
        }

        condition
        #{
			(pos().x() > -2)
        #};

        expression
        #{
        	U() + $[(vector)constants.bladeSpeed] // doesn't work
//			$[(vector)constants.bladeSpeed] //works
        #};
    }
);


// ************************************************************************* //
